Initial and Found are in units of molecules, and initial corresponds to my
coverage check on v2-tm on its training data. Molecules is the number of SMILES
in the corresponding output file from the initial search

I was using looser epsilon for the parameters with fewer initial molecule
matches, but 120h, in particular, had several very similar molecules. 0.7 seems
like a good cutoff for filtering out this kind of thing

#+name: results
| Parameter | Molecules | Initial | MinPts | Eps | Found |
|-----------+-----------+---------+--------+-----+-------|
| t143j     |         2 |       6 |      1 | 0.5 |     2 |
| t122g     |         3 |       5 |      1 | 0.5 |     2 |
| t133g     |         4 |       0 |      1 | 0.1 |     2 |
| t18b      |         8 |       0 |      1 | 0.1 |     2 |
| t87a      |        14 |       0 |      1 | 0.1 |     4 |
| t130h     |        18 |       0 |      1 | 0.1 |     8 |
| t120h     |        19 |       2 |      1 | 0.7 |     5 |
| t122l     |        19 |       2 |      1 | 0.7 |    10 |
| t42a      |        22 |      13 |      1 | 0.7 |     9 |
| t102      |        24 |       6 |      1 | 0.7 |    12 |
| t119h     |        28 |       3 |      1 | 0.7 |     6 |
| t62g      |        32 |       0 |      1 | 0.7 |     8 |
| t61g      |        33 |       0 |      1 | 0.7 |     9 |
| t133h     |        33 |       0 |      1 | 0.7 |     5 |
| t133i     |        42 |       5 |      1 | 0.7 |     7 |
| t122j     |        57 |       7 |      1 | 0.7 |     5 |
| t132h     |        58 |       8 |      1 | 0.7 |    11 |
| t130i     |        67 |       1 |      1 | 0.7 |    14 |
| t138a     |        96 |       0 |      1 | 0.7 |    12 |
| t103      |       100 |       8 |        |     |       |
| t118h     |       128 |       7 |        |     |       |
| t143k     |       132 |       5 |        |     |       |
| t112      |       147 |       4 |        |     |       |
| t142j     |       155 |       0 |        |     |       |
| t116i     |       158 |       0 |        |     |       |
| t164      |       189 |       5 |        |     |       |
| t8        |       199 |       6 |        |     |       |
| t113      |       226 |       8 |        |     |       |
| t7        |       250 |       8 |        |     |       |
| t155      |       280 |       9 |        |     |       |
| t126      |       281 |       3 |        |     |       |
| t73h      |       302 |      11 |        |     |       |
| t89       |       435 |       1 |        |     |       |
| t74h      |       463 |      10 |        |     |       |
| t142k     |       503 |       0 |        |     |       |
| t54       |       700 |      10 |        |     |       |
| t63       |       718 |      10 |        |     |       |
| t55       |       942 |      12 |        |     |       |
| t101      |       955 |       3 |        |     |       |
| t133j     |      1052 |      10 |        |     |       |
| t91       |      1168 |      10 |        |     |       |
| t100      |      1613 |       6 |        |     |       |
| t48a      |      1861 |       1 |        |     |       |
| t141      |      1974 |       6 |        |     |       |
| t65       |      2490 |      11 |        |     |       |
| t30       |      2563 |       6 |        |     |       |
| t153      |      2701 |      13 |        |     |       |
| t142h     |      2749 |       9 |        |     |       |
| t6        |      2809 |      14 |        |     |       |
| t12       |      3035 |      14 |        |     |       |
| t52       |      3339 |       9 |        |     |       |
| t56       |      3394 |       8 |        |     |       |
| t53       |      3525 |       9 |        |     |       |
| t19a      |      3535 |       4 |        |     |       |
| t88       |      3818 |       7 |        |     |       |
| t57       |      3960 |       5 |        |     |       |
| t18a      |      4245 |       3 |        |     |       |
| t37       |      4484 |      14 |        |     |       |
| t128      |      4494 |       8 |        |     |       |
| t125      |      4963 |       9 |        |     |       |
| t124      |      5129 |       7 |        |     |       |
| t136      |      6210 |      14 |        |     |       |
| t116j     |      6306 |       0 |        |     |       |
| t72h      |      6969 |       4 |        |     |       |
| t115h     |      7736 |       0 |        |     |       |
| t71h      |      9470 |      10 |        |     |       |
| t158      |     10273 |       5 |        |     |       |
| t122i     |     11357 |       5 |        |     |       |
| t82a      |     12265 |      11 |        |     |       |
| t134      |     13017 |      11 |        |     |       |
| t49       |     17544 |       9 |        |     |       |
| t123a     |     17562 |      10 |        |     |       |
| t82h      |     17847 |      10 |        |     |       |
| t135      |     18139 |       8 |        |     |       |
| t165      |     34267 |      13 |        |     |       |
| t99       |     36126 |      14 |        |     |       |
| t68       |     38862 |       9 |        |     |       |
| t141b     |     53491 |       1 |        |     |       |
| t150      |     62029 |       9 |        |     |       |
| t81       |     81527 |       1 |        |     |       |
| t83h      |     89906 |      12 |        |     |       |
| t141c     |    139173 |       9 |        |     |       |
| t141a     |    179719 |      10 |        |     |       |

#+begin_src awk :stdin results
  BEGIN {
	  COMPLETE = 6
	  head = "cargo run --bin fingerprint --release -- output/"
	  tail = " 2> /dev/null > /tmp/smiles"
  }
  function make_cmd(param, min_pts, eps) {
	  return sprintf("%s%s.smiles --parameter %s --min-pts %d --epsilon %f %s",
					 head, param, param, min_pts, eps, tail)
  }
  NR == 1 { print }
  NR > 1 && NF < COMPLETE {
	  smiles_file = "output/" $1 ".smiles"
	  param = $1
	  min_pts = NF > 3 ? $4 : 1
	  eps = NF > 4 ? $5 : 0.7
	  system(make_cmd(param, min_pts, eps))
	  cmd = "wc -l /tmp/smiles"
	  cmd | getline words
	  close(cmd)
	  split(words, arr)
	  print $1, $2, $3, min_pts, eps, arr[1]
  }
#+end_src

#+RESULTS:
| Parameter | Molecules | Initial | MinPts | Eps | Found |
| t103      |       100 |       8 |      1 | 0.7 |    54 |
| t118h     |       128 |       7 |      1 | 0.7 |    32 |
| t143k     |       132 |       5 |      1 | 0.7 |    17 |
| t143l     |       132 |       2 |      1 | 0.7 |     0 |
| t112      |       147 |       4 |      1 | 0.7 |    15 |
| t142j     |       155 |       0 |      1 | 0.7 |    32 |
| t116i     |       158 |       0 |      1 | 0.7 |    32 |
| t164      |       189 |       5 |      1 | 0.7 |    37 |
| t8        |       199 |       6 |      1 | 0.7 |    67 |
| t113      |       226 |       8 |      1 | 0.7 |    26 |
| t7        |       250 |       8 |      1 | 0.7 |    69 |
| t155      |       280 |       9 |      1 | 0.7 |    46 |
| t126      |       281 |       3 |      1 | 0.7 |    80 |
| t73h      |       302 |      11 |      1 | 0.7 |    81 |
| t89       |       435 |       1 |      1 | 0.7 |    30 |
| t74h      |       463 |      10 |      1 | 0.7 |    84 |
| t142k     |       503 |       0 |      1 | 0.7 |    77 |
| t142l     |       503 |       0 |      1 | 0.7 |     0 |
| t143i     |       503 |       0 |      1 | 0.7 |     0 |
| t54       |       700 |      10 |      1 | 0.7 |    55 |
| t63       |       718 |      10 |      1 | 0.7 |   119 |
| t55       |       942 |      12 |      1 | 0.7 |    57 |
| t101      |       955 |       3 |      1 | 0.7 |   136 |
| t133j     |      1052 |      10 |      1 | 0.7 |   185 |
| t91       |      1168 |      10 |      1 | 0.7 |   219 |
| t100      |      1613 |       6 |      1 | 0.7 |   182 |
| t48a      |      1861 |       1 |      1 | 0.7 |    67 |
| t141      |      1974 |       6 |      1 | 0.7 |   117 |
| t65       |      2490 |      11 |      1 | 0.7 |   218 |
| t30       |      2563 |       6 |      1 | 0.7 |    80 |
| t31a      |      2563 |      13 |      1 | 0.7 |     0 |
| t153      |      2701 |      13 |      1 | 0.7 |    66 |
| t142h     |      2749 |       9 |      1 | 0.7 |   164 |
| t6        |      2809 |      14 |      1 | 0.7 |   342 |
| t12       |      3035 |      14 |      1 | 0.7 |   520 |
| t52       |      3339 |       9 |      1 | 0.7 |   201 |
| t56       |      3394 |       8 |      1 | 0.7 |   151 |
| t53       |      3525 |       9 |      1 | 0.7 |   229 |
| t19a      |      3535 |       4 |      1 | 0.7 |   232 |
| t88       |      3818 |       7 |      1 | 0.7 |    67 |
| t57       |      3960 |       5 |      1 | 0.7 |   218 |
| t59g      |      3960 |       0 |      1 | 0.7 |     0 |
| t60g      |      3960 |       0 |      1 | 0.7 |     0 |
| t18a      |      4245 |       3 |      1 | 0.7 |   245 |
| t37       |      4484 |      14 |      1 | 0.7 |   368 |
| t128      |      4494 |       8 |      1 | 0.7 |   281 |
| t130g     |      4494 |       0 |      1 | 0.7 |     0 |
| t125      |      4963 |       9 |      1 | 0.7 |   128 |
| t124      |      5129 |       7 |      1 | 0.7 |   246 |
| t136      |      6210 |      14 |      1 | 0.7 |   249 |
| t116j     |      6306 |       0 |      1 | 0.7 |   673 |
| t72h      |      6969 |       4 |      1 | 0.7 |   227 |
| t115h     |      7736 |       0 |      1 | 0.7 |   802 |
| t71h      |      9470 |      10 |      1 | 0.7 |   310 |
| t158      |     10273 |       5 |      1 | 0.7 |   291 |
| t122i     |     11357 |       5 |      1 | 0.7 |   192 |
| t82a      |     12265 |      11 |      1 | 0.7 |   178 |
| t134      |     13017 |      11 |      1 | 0.7 |   703 |
| t49       |     17544 |       9 |      1 | 0.7 |   318 |
| t123a     |     17562 |      10 |      1 | 0.7 |   270 |
| t82h      |     17847 |      10 |      1 | 0.7 |   326 |
| t135      |     18139 |       8 |      1 | 0.7 |   347 |
| t165      |     34267 |      13 |      1 | 0.7 |  1096 |
| t99       |     36126 |      14 |      1 | 0.7 |   583 |
| t68       |     38862 |       9 |      1 | 0.7 |   634 |
| t141b     |     53491 |       1 |      1 | 0.7 |   579 |
| t150      |     62029 |       9 |      1 | 0.7 |   170 |
| t81       |     81527 |       1 |      1 | 0.7 |   403 |
| t83h      |     89906 |      12 |      1 | 0.7 |   526 |
| t141c     |    139173 |       9 |      1 | 0.7 |  3110 |
| t141a     |    179719 |      10 |      1 | 0.7 |  1615 |

# Local Variables:
# org-confirm-babel-evaluate: nil
# End:
